ahtn/keyplus/ports/efm8/efm8/mcu/C8051F960/inc/SI_C8051F960_Defs.h
//------------------------------------------------------------------------------
// Indirect Register Definitions
//------------------------------------------------------------------------------
#define ALARM0B0  0x08 ///< RTC Alarm 0 Programmed Value 0      
#define ALARM0B1  0x09 ///< RTC Alarm 0 Programmed Value 1      
#define ALARM0B2  0x0A ///< RTC Alarm 0 Programmed Value 2      
#define ALARM0B3  0x0B ///< RTC Alarm 0 Programmed Value 3      
#define ALARM1B0  0x0C ///< RTC Alarm 1 Programmed Value 0      
#define ALARM1B1  0x0D ///< RTC Alarm 1 Programmed Value 1      
#define ALARM1B2  0x0E ///< RTC Alarm 1 Programmed Value 2      
#define ALARM1B3  0x0F ///< RTC Alarm 1 Programmed Value 3      
#define ALARM2B0  0x10 ///< RTC Alarm 2 Programmed Value 0      
#define ALARM2B1  0x11 ///< RTC Alarm 2 Programmed Value 1      
#define ALARM2B2  0x12 ///< RTC Alarm 2 Programmed Value 2      
#define ALARM2B3  0x13 ///< RTC Alarm 2 Programmed Value 3      
#define CAPTURE0  0x00 ///< RTC Timer Capture 0                 
#define CAPTURE1  0x01 ///< RTC Timer Capture 1                 
#define CAPTURE2  0x02 ///< RTC Timer Capture 2                 
#define CAPTURE3  0x03 ///< RTC Timer Capture 3                 
#define DMA0NAOH0 0x00 ///< Channel 0 Memory Address Offset High
#define DMA0NAOH1 0x01 ///< Channel 1 Memory Address Offset High
#define DMA0NAOH2 0x02 ///< Channel 2 Memory Address Offset High
#define DMA0NAOH3 0x03 ///< Channel 3 Memory Address Offset High
#define DMA0NAOH4 0x04 ///< Channel 4 Memory Address Offset High
#define DMA0NAOH5 0x05 ///< Channel 5 Memory Address Offset High
#define DMA0NAOH6 0x06 ///< Channel 6 Memory Address Offset High
#define DMA0NAOL0 0x00 ///< Channel 0 Memory Address Offset     
#define DMA0NAOL1 0x01 ///< Channel 1 Memory Address Offset     
#define DMA0NAOL2 0x02 ///< Channel 2 Memory Address Offset     
#define DMA0NAOL3 0x03 ///< Channel 3 Memory Address Offset     
#define DMA0NAOL4 0x04 ///< Channel 4 Memory Address Offset     
#define DMA0NAOL5 0x05 ///< Channel 5 Memory Address Offset     
#define DMA0NAOL6 0x06 ///< Channel 6 Memory Address Offset     
#define DMA0NBAH0 0x00 ///< Channel 0 Memory Base Address High  
#define DMA0NBAH1 0x01 ///< Channel 1 Memory Base Address High  
#define DMA0NBAH2 0x02 ///< Channel 2 Memory Base Address High  
#define DMA0NBAH3 0x03 ///< Channel 3 Memory Base Address High  
#define DMA0NBAH4 0x04 ///< Channel 4 Memory Base Address High  
#define DMA0NBAH5 0x05 ///< Channel 5 Memory Base Address High  
#define DMA0NBAH6 0x06 ///< Channel 6 Memory Base Address High  
#define DMA0NBAL0 0x00 ///< Channel 0 Memory Base Address       
#define DMA0NBAL1 0x01 ///< Channel 1 Memory Base Address       
#define DMA0NBAL2 0x02 ///< Channel 2 Memory Base Address       
#define DMA0NBAL3 0x03 ///< Channel 3 Memory Base Address       
#define DMA0NBAL4 0x04 ///< Channel 4 Memory Base Address       
#define DMA0NBAL5 0x05 ///< Channel 5 Memory Base Address       
#define DMA0NBAL6 0x06 ///< Channel 6 Memory Base Address       
#define DMA0NCF0  0x00 ///< DMA0 Channel 0 Configuration        
#define DMA0NCF1  0x01 ///< DMA0 Channel 1 Configuration        
#define DMA0NCF2  0x02 ///< DMA0 Channel 2 Configuration        
#define DMA0NCF3  0x03 ///< DMA0 Channel 3 Configuration        
#define DMA0NCF4  0x04 ///< DMA0 Channel 4 Configuration        
#define DMA0NCF5  0x05 ///< DMA0 Channel 5 Configuration        
#define DMA0NCF6  0x06 ///< DMA0 Channel 6 Configuration        
#define DMA0NSZH0 0x00 ///< Channel 0 Memory Transfer Size High 
#define DMA0NSZH1 0x01 ///< Channel 1 Memory Transfer Size High 
#define DMA0NSZH2 0x02 ///< Channel 2 Memory Transfer Size High 
#define DMA0NSZH3 0x03 ///< Channel 3 Memory Transfer Size High 
#define DMA0NSZH4 0x04 ///< Channel 4 Memory Transfer Size High 
#define DMA0NSZH5 0x05 ///< Channel 5 Memory Transfer Size High 
#define DMA0NSZH6 0x06 ///< Channel 6 Memory Transfer Size High 
#define DMA0NSZL0 0x00 ///< Channel 0 Memory Transfer Size      
#define DMA0NSZL1 0x01 ///< Channel 1 Memory Transfer Size      
#define DMA0NSZL2 0x02 ///< Channel 2 Memory Transfer Size      
#define DMA0NSZL3 0x03 ///< Channel 3 Memory Transfer Size      
#define DMA0NSZL4 0x04 ///< Channel 4 Memory Transfer Size      
#define DMA0NSZL5 0x05 ///< Channel 5 Memory Transfer Size      
#define DMA0NSZL6 0x06 ///< Channel 6 Memory Transfer Size      
#define RTC0CF    0x07 ///< RTC Configuration                   
#define RTC0CN    0x04 ///< RTC Control                         
#define RTC0XCF   0x06 ///< RTC Oscillator Configuration        
#define RTC0XCN   0x05 ///< RTC Oscillator Control              

//------------------------------------------------------------------------------
// Bit Definitions
//------------------------------------------------------------------------------

// ACC (Accumulator)
#define SFR_ACC 0xE0
SBIT (ACC_ACC0, SFR_ACC, 0); ///< Accumulator Bit 0
SBIT (ACC_ACC1, SFR_ACC, 1); ///< Accumulator Bit 1
SBIT (ACC_ACC2, SFR_ACC, 2); ///< Accumulator Bit 2
SBIT (ACC_ACC3, SFR_ACC, 3); ///< Accumulator Bit 3
SBIT (ACC_ACC4, SFR_ACC, 4); ///< Accumulator Bit 4
SBIT (ACC_ACC5, SFR_ACC, 5); ///< Accumulator Bit 5
SBIT (ACC_ACC6, SFR_ACC, 6); ///< Accumulator Bit 6
SBIT (ACC_ACC7, SFR_ACC, 7); ///< Accumulator Bit 7

// ADC0CN (ADC0 Control)
#define SFR_ADC0CN 0xE8
SBIT (ADC0CN_ADCM0,  SFR_ADC0CN, 0); ///< Start of Conversion Mode Select Bit 0
SBIT (ADC0CN_ADCM1,  SFR_ADC0CN, 1); ///< Start of Conversion Mode Select Bit 1
SBIT (ADC0CN_ADCM2,  SFR_ADC0CN, 2); ///< Start of Conversion Mode Select Bit 2
SBIT (ADC0CN_ADWINT, SFR_ADC0CN, 3); ///< Window Compare Interrupt Flag        
SBIT (ADC0CN_ADBUSY, SFR_ADC0CN, 4); ///< ADC Busy                             
SBIT (ADC0CN_ADINT,  SFR_ADC0CN, 5); ///< Conversion Complete Interrupt Flag   
SBIT (ADC0CN_ADBMEN, SFR_ADC0CN, 6); ///< Burst Mode Enable                    
SBIT (ADC0CN_ADEN,   SFR_ADC0CN, 7); ///< ADC Enable                           

// B (B Register)
#define SFR_B 0xF0
SBIT (B_B0, SFR_B, 0); ///< B Register Bit 0
SBIT (B_B1, SFR_B, 1); ///< B Register Bit 1
SBIT (B_B2, SFR_B, 2); ///< B Register Bit 2
SBIT (B_B3, SFR_B, 3); ///< B Register Bit 3
SBIT (B_B4, SFR_B, 4); ///< B Register Bit 4
SBIT (B_B5, SFR_B, 5); ///< B Register Bit 5
SBIT (B_B6, SFR_B, 6); ///< B Register Bit 6
SBIT (B_B7, SFR_B, 7); ///< B Register Bit 7

// IE (Interrupt Enable)
#define SFR_IE 0xA8
SBIT (IE_EX0,   SFR_IE, 0); ///< External Interrupt 0 Enable
SBIT (IE_ET0,   SFR_IE, 1); ///< Timer 0 Interrupt Enable   
SBIT (IE_EX1,   SFR_IE, 2); ///< External Interrupt 1 Enable
SBIT (IE_ET1,   SFR_IE, 3); ///< Timer 1 Interrupt Enable   
SBIT (IE_ES0,   SFR_IE, 4); ///< UART0 Interrupt Enable     
SBIT (IE_ET2,   SFR_IE, 5); ///< Timer 2 Interrupt Enable   
SBIT (IE_ESPI0, SFR_IE, 6); ///< SPI0 Interrupt Enable      
SBIT (IE_EA,    SFR_IE, 7); ///< All Interrupts Enable      

