ahtn/keyplus/ports/efm8/efm8/mcu/C8051F960/inc/SI_C8051F960_Defs.h
// TCON (Timer 0/1 Control)
#define SFR_TCON 0x88
SBIT (TCON_IT0, SFR_TCON, 0); ///< Interrupt 0 Type Select
SBIT (TCON_IE0, SFR_TCON, 1); ///< External Interrupt 0   
SBIT (TCON_IT1, SFR_TCON, 2); ///< Interrupt 1 Type Select
SBIT (TCON_IE1, SFR_TCON, 3); ///< External Interrupt 1   
SBIT (TCON_TR0, SFR_TCON, 4); ///< Timer 0 Run Control    
SBIT (TCON_TF0, SFR_TCON, 5); ///< Timer 0 Overflow Flag  
SBIT (TCON_TR1, SFR_TCON, 6); ///< Timer 1 Run Control    
SBIT (TCON_TF1, SFR_TCON, 7); ///< Timer 1 Overflow Flag  

// TMR2CN (Timer 2 Control)
#define SFR_TMR2CN 0xC8
SBIT (TMR2CN_T2XCLK0, SFR_TMR2CN, 0); ///< Timer 2 External Clock Select Bit 0
SBIT (TMR2CN_T2XCLK1, SFR_TMR2CN, 1); ///< Timer 2 External Clock Select Bit 1
SBIT (TMR2CN_TR2,     SFR_TMR2CN, 2); ///< Timer 2 Run Control                
SBIT (TMR2CN_T2SPLIT, SFR_TMR2CN, 3); ///< Timer 2 Split Mode Enable          
SBIT (TMR2CN_TF2CEN,  SFR_TMR2CN, 4); ///< Timer 2 Capture Enable             
SBIT (TMR2CN_TF2LEN,  SFR_TMR2CN, 5); ///< Timer 2 Low Byte Interrupt Enable  
SBIT (TMR2CN_TF2L,    SFR_TMR2CN, 6); ///< Timer 2 Low Byte Overflow Flag     
SBIT (TMR2CN_TF2H,    SFR_TMR2CN, 7); ///< Timer 2 High Byte Overflow Flag    

//------------------------------------------------------------------------------
// Interrupt Definitions
//------------------------------------------------------------------------------
#define INT0_IRQn      0  ///< External Interrupt 0                 
#define TIMER0_IRQn    1  ///< Timer 0 Overflow                     
#define INT1_IRQn      2  ///< External Interrupt 1                 
#define TIMER1_IRQn    3  ///< Timer 1 Overflow                     
#define UART0_IRQn     4  ///< UART 0                               
#define TIMER2_IRQn    5  ///< Timer 2 Overflow                     
#define SPI0_IRQn      6  ///< SPI0                                 
#define SMBUS0_IRQn    7  ///< SMBus 0                              
#define RTC0ALARM_IRQn 8  ///< RTC0 Alarm                           
#define ADC0WC_IRQn    9  ///< ADC0 Window Compare                  
#define ADC0EOC_IRQn   10 ///< ADC0 End of Conversion               
#define PCA0_IRQn      11 ///< PCA0                                 
#define CMP0_IRQn      12 ///< Comparator 0                         
#define CMP1_IRQn      13 ///< Comparator 1                         
#define TIMER3_IRQn    14 ///< Timer 3 Overflow                     
#define VDDMON_IRQn    15 ///< VBAT/VDD Supply Monitor Early Warning
#define PMATCH_IRQn    16 ///< Port Match                           
#define RTC0FAIL_IRQn  17 ///< RTC0 Oscillator Fail                 
#define SPI1_IRQn      18 ///< SPI1                                 
#define PC0_IRQn       19 ///< Pulse Counter                        
#define DMA0_IRQn      20 ///< DMA0                                 
#define ENCDEC0_IRQn   21 ///< Encoder / Decoder                    
#define AES0_IRQn      22 ///< AES0                                 

//------------------------------------------------------------------------------
// SFR Page Definitions
//------------------------------------------------------------------------------
#define LEGACY_PAGE 0x00 ///< Legacy SFR Page                           
#define AES0_PAGE   0x02 ///<                                           
#define CRC1_PAGE   0x02 ///<                                           
#define DMA0_PAGE   0x02 ///<                                           
#define DPPE_PAGE   0x02 ///< Data Packet Processing Engine (DPPE) Page 
#define ENC0_PAGE   0x02 ///< Encoder / Decoder Page                    
#define LCD0_PAGE   0x02 ///<                                           
#define SPI1_PAGE   0x02 ///<                                           
#define CONFIG_PAGE 0x0F ///< System and Port Configuration Page        
#define CRC0_PAGE   0x0F ///<                                           
#define TOFF_PAGE   0x0F ///< Temperature Sensor Calibration Offset Page

//-----------------------------------------------------------------------------
// SDCC PDATA External Memory Paging Support
//-----------------------------------------------------------------------------

#if defined SDCC

SFR(_XPAGE, 0xAA); // Point to the EMI0CN register

#endif

#endif // SI_C8051F960_DEFS_H
//-eof--------------------------------------------------------------------------

